# AngularDimensionsMeasurementOptions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..AngularDimensionsMeasurementOptions Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies the measurement option for angular dimensions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get; set; }
```

Visual Basic
---
```text
Public Property AngularDimensionsMeasurementOptions As BendingDetailAngularDimensionsMeasurementOptions
	Get
	Set
```

Visual C++
---
```text
public:
property BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions {
	BendingDetailAngularDimensionsMeasurementOptions get ();
	void set (BendingDetailAngularDimensionsMeasurementOptions value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace